openfoam/NASA_hump_data_no_turbulence/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "100";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
69120
(
(0.016331827 1.457214e-07 0)
(0.016322607 2.6713558e-08 0)
(0.014683243 3.1645141e-08 0)
(0.013823365 2.2930265e-08 0)
(0.012705841 2.5918922e-08 0)
(0.011767666 4.68296e-09 0)
(0.010855505 8.6890228e-09 0)
(0.010050445 2.0425564e-09 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
96
(
(0.01709894 0 0)
(0.053006195 0 0)
(0.092510516 0 0)
(0.13596981 0 0)
(0.18377707 0 0)
(0.23636374 0 0)
(0.29420327 0 0)
(0.35781511 0 0)
...
)
;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    hump
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
