openfoam/NASA_hump_data_no_turbulence/0/force
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "100";
    object      force;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    hump
    {
        type            calculated;
        value           nonuniform List<vector> 
320
(
(0.0063258244 -0.060650465 5.9324238e-21)
(0.0097942364 -0.062216986 1.1877784e-20)
(0.013585316 -0.06365491 -1.2914894e-21)
(0.017719022 -0.064866656 2.586462e-21)
(0.022031851 -0.065909319 2.2771734e-26)
(0.026287719 -0.066885743 5.0396907e-20)
(0.030429989 -0.067801105 -2.6556685e-20)
(0.034422759 -0.068764317 -2.2876483e-26)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
