openfoam/NASA_hump_data_no_turbulence/0/initialResidual:Uy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "100";
    object      initialResidual:Uy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
69120
(
-6.7598604e-10
-5.3269416e-10
-1.0426632e-09
-1.0760615e-09
-1.9916334e-09
-1.8323449e-09
-2.1448204e-09
-2.222416e-09
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    hump
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
