openfoam/NASA_hump_data_no_turbulence/0/initialResidual:p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "100";
    object      initialResidual:p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
69120
(
-5.8189068e-11
-4.6517669e-11
-9.7615476e-11
-7.0571464e-11
-5.2348792e-11
-1.5034281e-10
-1.0772381e-10
-1.4052208e-10
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    hump
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
