openfoam/NASA_hump_data_no_turbulence/0/moment
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "100";
    object      moment;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    hump
    {
        type            calculated;
        value           nonuniform List<vector> 
320
(
(0.0030325233 0.00031629122 -0.00015736969)
(0.0031108493 0.00048971182 -0.00049234213)
(0.0031827455 0.0006792658 -0.0008590447)
(0.0032433328 0.00088595111 -0.0012580864)
(0.0032954659 0.0011015926 -0.0016914976)
(0.0033442871 0.0013143859 -0.0021629451)
(0.0033900553 0.0015214995 -0.0026746149)
(0.0034382158 0.001721138 -0.0032325089)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
