openfoam/NASA_hump_data_no_turbulence/0/pWall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "100";
    object      pWall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
69120
(
117.02453
109.78476
107.66111
104.40901
101.92909
99.643036
97.709654
95.975807
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
380
(
115.21822
111.06877
107.38294
104.60714
101.98291
99.737097
97.765921
96.037895
...
)
;
    }
    hump
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
96.455422
96.553497
96.671784
96.805959
96.962765
97.149288
97.372552
97.638618
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
