openfoam/NASA_hump_data_no_turbulence/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "100";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
137424
(
1.6331182e-08
7.4829658e-10
1.5552184e-08
7.6954276e-10
1.428053e-08
1.2205262e-09
1.3299132e-08
9.4961139e-10
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
-1.7100017e-08
-5.8352056e-08
-1.1210444e-07
-1.8137455e-07
-2.6985306e-07
-3.8204898e-07
-5.2346525e-07
-7.0081147e-07
...
)
;
    }
    topWall
    {
        type            symmetry;
        value           uniform 0;
    }
    jet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
-4.9487714e-10
-1.6910833e-09
-3.2481172e-09
-5.2467881e-09
-7.7843762e-09
-1.0976295e-08
-1.4958765e-08
-1.9891592e-08
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    hump
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
