openfoam/NASA_hump_data_no_turbulence/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "100";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
380
(
(-4.9887323 -0.00010447843 0)
(-4.9859157 -5.1040507e-05 0)
(-4.4851544 -7.1338361e-05 0)
(-4.2224955 -4.9230032e-05 0)
(-3.8811359 -4.7779e-05 0)
(-3.5945602 -3.1455997e-05 0)
(-3.3159306 -2.7902386e-05 0)
(-3.0700165 -2.0319255e-05 0)
...
)
;
    }
    hump
    {
        type            calculated;
        value           nonuniform List<vector> 
320
(
(0.028440273 0.0029740869 -9.3827163e-18)
(0.027610813 0.0043504486 -1.8208069e-17)
(0.027402315 0.0058482175 -3.5324781e-17)
(0.023070875 0.0062962026 6.8571392e-17)
(0.017687561 0.0058964042 -3.1770278e-23)
(0.0076172865 0.0029744211 1.6774655e-23)
(-0.0072768882 -0.0033057425 -3.1383628e-17)
(-0.030357279 -0.015238401 2.9042779e-23)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
