openfoam/NASA_hump_data_no_turbulence/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "100";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            symmetry;
    }
    jet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
380
(
0.0073120589
0.0073099944
0.0069331928
0.0067271201
0.0064494697
0.0062067959
0.0059613868
0.0057360766
...
)
;
    }
    hump
    {
        type            calculated;
        value           nonuniform List<scalar> 
320
(
0.00055609259
0.00054825279
0.00054539816
0.00049859265
0.00043391259
0.00028241448
0.00027380072
0.00055285511
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
