openfoam/NASA_hump_data_no_turbulence/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
|                  |                                                          |
|   F ield         | FOAM:     The Open Source CFD Toolbox                    |
|   O peration     | Version:  1.5-2.2                                        |
|   A nd           | Web:      http://www.iconcfd.com                         |
|   M anipulation  |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "../constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel        SpalartAllmaras;
turbulence      on;

// ************************************************************************* //
