openfoam/NASA_hump_data_no_turbulence/system/include/coords20
(0.654157 0.115013 0.1)
(0.654157 0.114408 0.1)
